<a href="https://colab.research.google.com/github/kunal24bit/Data-Pre-processing/blob/main/Handling_Categorical_features_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Handle Catgorical features**

*One hot Encoding*

In [43]:
import pandas as pd

In [44]:
df = pd.read_csv("titanic.csv", usecols = ["Sex"])

In [45]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [46]:
df.head(4)

      Sex
0    male
1  female
2  female
3  female

In [47]:
pd.get_dummies(df, drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [48]:
df1 = pd.read_csv("titanic.csv", usecols=["Embarked"])

In [49]:
df1.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [50]:
df1["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [51]:
pd.get_dummies(df1, drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

*One hot Encoding with many categories in a feature*

In [52]:
df2 = pd.read_csv("mercedes.csv", usecols = ["X0","X1","X2","X3","X4","X5","X6"])

In [53]:
df2.head(20)

    X0  X1  X2 X3 X4 X5 X6
0    k   v  at  a  d  u  j
1    k   t  av  e  d  y  l
2   az   w   n  c  d  x  j
3   az   t   n  f  d  x  l
4   az   v   n  f  d  h  d
5    t   b   e  c  d  g  h
6   al   r   e  f  d  f  h
7    o   l  as  f  d  f  j
8    w   s  as  e  d  f  i
9    j   b  aq  c  d  f  a
10   h   r   r  f  d  f  h
11  al   r   e  f  d  f  h
12   s   b  ai  c  d  f  g
13  al   r   e  f  d  j  h
14   o   s  as  e  d  j  g
15   n   l  ak  f  d  j  d
16  al   r   e  f  d  j  h
17  ay  aa  as  c  d  j  c
18   f   c   m  c  d  j  d
19   n   a  ak  f  d  j  i

In [54]:
for i in df2.columns:
  print(len(df2[i].unique()))

47
27
44
7
4
29
12

In [78]:
#Top 10 most frequent categories for the variable X1
df2.X1.value_counts().sort_values(ascending = False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [79]:
#make a list for the most frequest categories of the variable
lst_10 = df2.X1.value_counts().sort_values(ascending = False).head(10).index
lst_10 = list(lst_10)

In [80]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [81]:
import numpy as np

for categories in lst_10:
  df2[categories] = np.where(df2['X1'] == categories,1,0)

In [82]:
lst_10.append('X1')

In [83]:
df2[lst_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]